{"count":"4","first":"Mbappe, Bentancur and 10 young stars to watch out for at World Cup 2018","second":"It can’t have been easy arriving at Leicester City as the man to fill the gap left behind by N’Golo Kante, but Ndidi has fitted in superbly at the King Power Stadium over the last 18 months and continues to be a key part of Nigeria’s senior setup.A real ‘box of tricks’ player, Tielemans has the weight of pass and perceptive footballing brain which could make him one of the game’s great stars in the years to come.Iceland are not done pulling up trees if Albert Gudmundsson is anything to go by. With great movement and the desire to play instinctively, the left winger has come on a huge amount as he’s risen through the ranks at PSV. He also happens to be a cool finisher when the opportunity arises.With an ability to keep the ball under his spell thanks to his short-stepping style and being able to deliver the killer ball that can split a defence apart, it is easy to see that Goncalo Guedes takes his inspiration from national skipper Cristiano Ronaldo.The right-back became the youngest Liverpool player to play in the Champions League final when lining up against Real Madrid last month, and his breakout 2017-18 has led to him getting his first England senior call-up for the World Cup.After swapping Borussia Dortmund for Barcelona  last summer in a €105m deal, it is fair to say that Dembele has already made a splash on the world stage.He may have only five Serie A starts under his belt since moving to Juventus from Boca Juniors a year ago but Bentancur has recruited an army of followers off the back of his promising displays for the Bianconeri.The Manchester United forward has scored goals on his Premier League, Champions League, Europa League and League Cup debuts at club level and also netted in his first England under-21 appearance and his senior bow. Now he heads to his first World Cup with a wonderful chance to display his explosive forward play.It somehow feels as though Gabriel Jesus is already a veteran despite only being 21 such has been his impact to date. With over 150 senior appearances to his name and a Premier League title winner’s medal freshly stashed in his pocket he looks primed to play a huge role this summer for Brazil.The €180m teenager looks primed to make a real impact at this World Cup after helping Paris Saint-Germain to regain the Ligue 1 title alongside Neymar in 2017-18.","third":"Man Utd: Fred deal agreed and Diogo Dalot set to sign","fourth":"Manchester United have reached an agreement to sign Brazil midfielder Fred from Shakhtar Donetsk for a reported £47m.The 25-year-old, who has been selected for this summer's World Cup, is set to become Old Trafford boss Jose Mourinho's first signing of the summer.United are also closing in on Porto's 19-year-old defender Diogo Dalot and should complete the deal this week.Dalot has a £17.4m release clause and is understood to have had his medical.The transfer should hasten the exits of Italian full-back Matteo Darmian, who has been strongly linked with Juventus, and Netherlands defender Daley Blind, neither of whom has a long-term future under Mourinho.Fred is in Brazil's World Cup squad and appeared as an 82nd-minute substitute for his country as they beat Croatia 2-0 in a friendly at Anfield on Sunday.Brazil coach Tite had said he wanted his players' domestic futures sorted before the tournament in Russia, which starts on 14 June.Born in Belo Horizonte, Fred moved to Europe in 2013 from Brazilian club Internacional and enjoyed success during five years in Ukraine.He helped Shakhtar to win three league titles, three Ukrainian Cups and four Ukrainian Super Cups.Fred also helped Shakhtar reach the Champions League knockout stages in 2017-18. He played in wins over Manchester City and Napoli, scoring in a 2-1 win over Roma in the last 16.Chelsea winger Willian, who played for Shakhtar between 2007 and 2013, believes Fred will he a success in England.\"He has a lot of quality, he can improve a lot,\" he said. \"He goes to one of the best teams in the world and I'm happy for him. I hope he does well at Manchester United.\"He is very happy to come to the Premier League to play, we talked a little bit about that.\"He is excited to start but now it is time to think about the World Cup and think about the national team.\"However, Fred's career has not been without controversy.In December 2015, he was given a one-year ban after testing positive for a banned diuretic, which was backdated to June that year when the test was carried out.The suspension only applied to games sanctioned by South American football federation Conmebol.South American football expert Tim VickeryManchester United are getting a fine player for their money. Pep Guardiola was very impressed when Fred played against Manchester City for Shakhtar in the Champions League in 2017-18.You can see something of a mini version of [Manchester City midfielder] Fernandinho.United are getting a little, stocky, left-footed midfielder who will bring real dynamism. Fred can work box to box, he has a lovely left foot, he's improving very nicely and has picked up valuable European experience."}